In [1]:
import pandas as pd

# Задание 1
Скачайте с сайта grouplens.org...movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [10]:
# читаем таблицу с рейтингами, смотрим как выглядит
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [67]:
# выбираем фильмы с рейтингом 5.0 в таблицу rating_5
rating_5 = ratings[ ratings.rating == 5.0 ]
rating_5.head()

   userId  movieId  rating  timestamp
3       1       47     5.0  964983815
4       1       50     5.0  964982931
6       1      101     5.0  964980868
8       1      151     5.0  964984041
9       1      157     5.0  964984100

In [71]:
# находим фильм с наибольшим количеством оценок 5.0 через value_counts
# выбираем верхнюю строку через head(1) и берем ее индекс, который даст нам искомый movieId "лучшего" фильма
best_movieId = rating_5['movieId'].value_counts().head(1).index
print(best_movieId)

Int64Index([318], dtype='int64')

In [15]:
# читаем movies.csv, проверяем как выглядит
movies = pd.read_csv('movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [72]:
# ищем строку, где movieId соответствует Id лучшего фильма (best_movieId)
movies[movies['movieId'].isin(best_movieId)]

     movieId                             title       genres
277      318  Shawshank Redemption, The (1994)  Crime|Drama

# Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [74]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [93]:
# создаем новую таблицу через фильтр на 3 страны, 3 категории и 6 лет
filtered_countries = power[ (power['country'].isin(['Latvia', 'Lithuania', 'Estonia'])) & (power['category'].isin([4, 12, 21])) & (power['year'].isin(range(2005, 2011)))]
filtered_countries.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [94]:
# суммируем все значения столбца quantity в новой таблице
filtered_countries['quantity'].sum()

240481.0

# Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [107]:
url = 'http://tikr.ru/stock/'
pd.read_html(url, encoding='utf-8')

[        0       1   2
 0  email:  пароль NaN
 1     NaN     NaN NaN,
       0                  1           2         3
 0   1.0            Газпром    258.0100  ↓ -0.44%
 1   2.0    Сбербанк России    301.3500  ↑ +1.59%
 2   3.0  Норильский никель  27072.0000      ↓ 0%
 3   4.0             Магнит   5298.5000   ↑ +2.7%
 4   5.0             ЛУКОЙЛ   5797.5000   ↑ +1.5%
 5   6.0         Северсталь   1782.2000   ↓ -1.7%
 6   7.0           Роснефть    525.8000  ↑ +1.68%
 7   8.0                ММК     65.5600  ↑ +0.25%
 8   9.0           Банк ВТБ      0.0456  ↓ -1.45%
 9  10.0             Yandex   4771.4000   ↑ +0.4%,
                 название тикер       курс      макс.       мин. изменение  \
 0                    GTL  GTLC     0.0825     0.0849     0.0809   -1.31 %
 1                 Yandex  YNDX  4771.4000  4796.6000  4692.0000    +0.4 %
 2            Абрау-Дюрсо  ABRD   194.0000   196.5000   193.5000    -0.8 %
 3                  Акрон  AKRN  6070.0000  6090.0000  6010.0000      -0 %
 4              АЛОР БАНК  ALBK    65.0000    68.0000    65.0000       0 %
 ..                   ...   ...        ...        ...        ...       ...
 153        Южный Кузбасс  UKUZ   580.0000   580.0000   576.0000       0 %
 154         Южуралникель  UNKL  9360.0000  9400.0000  9230.0000      +1 %
 155                ЮТэйр  UTAR     7.0900     7.0900     7.0000   +2.01 %
 156             ЯкутскЭн  YKEN     0.4235     0.4295     0.4175   -2.64 %
 157  ЯрославльЭнергоСбыт  YRSB   220.0000   220.0000   216.0000      -1 %

     изменение за месяц изменение за год  объём торгов
 0             +77.04 %          +3.64 %       1895624
 1              +2.94 %         +66.07 %    2147483647
 2              -1.52 %         +49.23 %       2571405
 3              -0.52 %         +83.38 %       9800840
 4              -2.26 %         +14.04 %        226595
 ..                 ...              ...           ...
 153           +11.11 %          +6.42 %         37096
 154            -1.68 %        +176.92 %        419300
 155            -1.12 %          -23.6 %        283432
 156           +23.47 %         +23.47 %        350690
 157            +0.92 %         +30.95 %         34820

 [158 rows x 9 columns]]